{
	"@metadata": {
		"authors": [
			"Florian Schmidt",
			"Shirayuki",
			"Umherirrender",
			"George Animal",
			"Liuxinyu970226"
		]
	},
	"googlelogin": "{{doc-special|GoogleLogin}}\nAlso used as label for the button shown in [[Special:Login]].",
	"managegooglelogin": "Title of Special:ManageGoogleLogin",
	"googlelogin-managelegend": "Text used in legend on Special:ManageGoogleLogin.",
	"googlelogin-manage-usersubmit": "Submit text for find user form on Special:ManageGoogleLogin.",
	"googlelogin-manage-notexist": "Indicates, that the user to manage does not exist.\n* $1 - The username entered",
	"googlelogin-manage-user": "Used on Special:ManageGoogleLogin to show, which user is managed.\n* $1 - The name of the managed user",
	"googlelogin-manage-linked": "Message, that indicates, that the Wiki user is linked with a Google account.\n* $1 - Google ID of the linked Google account",
	"googlelogin-manage-notlinked": "Message that indicates, that the Wiki user isn't linked with a Google account.",
	"googlelogin-manage-changelegend": "Legendmessage for the \"Change Google ID\" form on Special:ManageGoogleLogin.",
	"googlelogin-manage-noplus": "Notice message, that the passed Google ID doesn't have a Plus profile, including a hint to check a typing error.",
	"googlelogin-manage-changedsuccess": "Indicates, that the manages user is linked with the Google account now.",
	"googlelogin-manage-terminatesuccess": "Successmessage when the connection between the User and Google account was removed.",
	"googlelogin-manage-changederror": "Indicates an error while trying to link the Wiki user and Google account.",
	"googlelogin-manage-terminatebutton": "Buttonlabel to terminate the connection between Google account and Wiki user.",
	"googlelogin-manage-invalidid": "Notice, that the given Google ID is invalid and needs to be numeric.",
	"googlelogin-manage-isplusser": "Label for a field that indicates, if the User is registered in Google Plus.",
	"googlelogin-manage-orgname": "Label for field that shows the actual organization the User works in.",
	"googlelogin-manage-orgtitle": "Name of the job position of the User.",
	"googlelogin-manage-orgsince": "Since when the User works in the organization.\n* {{msg-mw|Googlelogin-manage-orgname}}",
	"googlelogin-manage-yes": "Used to indicate if a user is registered on Google Plus.",
	"googlelogin-manage-no": "Used to indicate if a user isn't registered on Google Plus.",
	"googlelogin-manage-dismiss": "Buttonlabel for a dismiss function.",
	"googlelogin-manage-openpluslink": "Label for link to open the Google Plus profile of the user.",
	"googlelogin-manage-unknownerror": "Error message, when the Google Plus profile data could not be loaded.",
	"googlelogin-manage-plusinfo-title": "Title of the information dialog on [[Special:ManageGoogleLogin]].",
	"googlelogin-manage-errorloading": "Title of an error dialog with a generic \"There was an error\" message.",
	"googlelogin-username": "Used to indicate a username input field.",
	"googlelogin-create": "Used as label for the button shown in [[Special:CreateAccount]].",
	"googlelogin-desc": "{{desc|name=Google Login|url=https://www.mediawiki.org/wiki/Extension:GoogleLogin}}",
	"googlelogin-parerror": "Error message when a Subpage of Special:GoogleLogin is requested, which does not exist.",
	"googlelogin-generic-error": "Generic error message for errors with no specific error message.\n\nParameters:\n* $1 - a short description of the error (e.g. Database error)",
	"googlelogin-createnotallowed": "Error message displayed on [[Special:GoogleLogin]], that the user isn't allowed to create a new wiki user account with GoogleLogin.",
	"googlelogin-unallowed-domain": "The domain of the user isn't allowed to use with Google Login, show this as an error message. $1 is the E-Maildomain used.",
	"googlelogin-error-unknownconnected": "An error message shown, when the user tries to login with a Google account which wiki account doesn't exist (anymore). The connection between both will be removed. The user has to create a new wiki account or use an existent.",
	"googlelogin-form-choosename-title": "Title of SpecialPage when the user can create a new user and has to choose an Username.",
	"googlelogin-form-choosename": "Title of fieldset to explain shortly, what the user has to do (choose username).",
	"googlelogin-form-choosename-finish-title": "Title of Subpage 'Finish' after the Useraccount is successful created.",
	"googlelogin-form-choosename-finish-body": "Message for Subpage 'Finish' after the Useraccount is successful created.",
	"googlelogin-form-choosename-error": "Message after the user did not provide a Username to explain, that he must choose a Username (own or one of the suggestions)",
	"googlelogin-form-choosename-existerror": "The username the user want to use for their user account already exists, they must use another.\n\nParameters:\n* $1 - username",
	"googlelogin-form-chooseown": "Label for radio element to choose an own username for the creation of a new user account.",
	"googlelogin-form-chooseown-error": "The user want to choose an own Username, but the input field for the username is empty. The user must provide a username or choose one of the suggestions.",
	"googlelogin-form-choosename-placeholder": "Used ad a placeholder for the input field on the user creation form to choose a new user name.\n\nRefers to {{msg-mw|Googlelogin-form-chooseown}}.",
	"googlelogin-form-merge-title": "Title of button to merge the wiki and Google account.",
	"googlelogin-form-logout": "Title of button to choose another Google account to merge/create (to/a new) wiki account. (logout the currently Google account in wiki)",
	"googlelogin-form-backlink": "Used as link text on subpages of Special:GoogleLogin to go back to Main special page [[Special:GoogleLogin]].",
	"googlelogin-form-next": "Button label used to indicate to got to the next step in a multi-step workflow.\n{{Identical|Next}}",
	"googlelogin-form-merge": "Title of button to merge the wikiaccount and Google account, if the user is logged into a wikiaccount (and not connected to a Google account) and navigates to Special:GoogleLogin.",
	"googlelogin-form-unlink": "Title of button to unlink the connection between the wiki user account and Google account.",
	"googlelogin-email": "Title of value email address in account information table on [[Special:GoogleLogin]].\n{{Identical|E-mail address}}",
	"googlelogin-googleuser": "Title of value Google-Account (Google username) in account information table on Special:GoogleLogin.",
	"googlelogin-information-title": "Title of fieldset containing the table with account information.\n{{Identical|Account information}}",
	"googlelogin-information-body": "Information text above account information table, that the following table contains information about the Google and wiki account and the link status (linked, not linked).",
	"googlelogin-linkstatus": "Title of value Link status in account information table on Special:GoogleLogin (is wiki account linked to Google account?).",
	"googlelogin-linked": "Google and wiki account are linked. (Used in account information table)",
	"googlelogin-login-already-registered": "Option for the user when the Google account isn't linked with any wiki account yet, to use an already existing account, instead of creating a new one.",
	"googlelogin-login-merge-warning": "Warning message to explain the user, why he is redirected to the login page (to login and link the wiki account with the Google account).",
	"googlelogin-or": "'or' to show as seperator on login page (GoogleLogin 'or' MediaWiki Login).\n\nPreceded by {{msg-mw|Googlelogin}} button.\n\nFollowed by the standard login form.\n{{Identical|Or}}",
	"googlelogin-unlinked": "Google and wiki account aren't linked. (Used in account information table)",
	"googlelogin-link-other": "The Google account is already linked to a wiki user, but not to the actual logged in wiki user. To link the Google account with the actual wiki account, the user must unlink the connection wit the other wiki account, only one connection per Google account is allowed.",
	"googlelogin-success-merge": "Successful message, that the wiki account is now linked with the Google account.",
	"googlelogin-success-unlink": "Successful message, that the wiki account isn't linked anymore with the Google account.",
	"googlelogin-prefs-status": "Name of the Line in Special:Preferences identifying GoogleLoign status (linked or not linked).",
	"tag-googlelogin": "Tag in [[Special:RecentChanges]] for user account creations made with GoogleLogin.\n\nSee also:\n* {{msg-mw|Tag-googlelogin-description}}",
	"tag-googlelogin-description": "Short description, that account creations with this tag are made with GoogleLogin.",
	"action-managegooglelogin": "Message key for user right \"managegooglelogin\"",
	"right-managegooglelogin": "Description of user right to view, edit and remove Google Login connections.\n\n{{Doc-right|mf-uploadbutton}}"
}
